In [1]:
import pandas as pd
import numpy as np

In [3]:
x = pd.Series([10, 20, 30, 40, 50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
x.dtype

dtype('int64')

In [7]:
sales = pd.Series([4500, 6500, 8700], index = ['one', 'two', 'three'])
sales

one      4500
two      6500
three    8700
dtype: int64

In [8]:
sales.index

Index(['one', 'two', 'three'], dtype='object')

In [9]:
sales['two'] # Find the value of the index two

6500

In [10]:
sales[0] # Reference the index

4500

In [11]:
sales > 5000 # Can use for filtering

one      False
two       True
three     True
dtype: bool

In [13]:
sales[sales > 5000] # Sales greater than 5000

two      6500
three    8700
dtype: int64

In [14]:
'one' in sales

True

In [15]:
'five' in sales

False

In [17]:
6500 in sales # Returns false because 6500 is not in the index

False

In [19]:
sales_dict = sales.to_dict()
sales_dict

{'one': 4500, 'two': 6500, 'three': 8700}

In [21]:
new_sales = {'five': 500, 'six': 600, 'seven': 700}
new_sales

{'five': 500, 'six': 600, 'seven': 700}

In [23]:
new_sales = pd.Series(new_sales, index = ['one', 'five', 'six'])
new_sales

one       NaN
five    500.0
six     600.0
dtype: float64

In [24]:
np.isnan(new_sales['one'])

True

In [26]:
new_sales['one'] is None

False

In [27]:
pd.isnull(new_sales)

one      True
five    False
six     False
dtype: bool

In [28]:
new_sales.name = 'Total TV Sales'
new_sales

one       NaN
five    500.0
six     600.0
Name: Total TV Sales, dtype: float64

In [29]:
new_sales.index.name = 'SalesPerson'
new_sales

SalesPerson
one       NaN
five    500.0
six     600.0
Name: Total TV Sales, dtype: float64

In [37]:
# Create a series for everyone in data 14
# How many countries they have visited
# Index name
# name for series
data14 = {'Alex': 1,
          'Anthony': 1,
          'Ben': 2,
          'Joe': 0,
          'Juxhen': 2,
          'Katie': 1}
data14_series = pd.Series(data14)
data14_series.name = 'Number of countries visited by Data 14'
data14_series.index.name = 'Person'
data14_series

Person
Alex       1
Anthony    1
Ben        2
Joe        0
Juxhen     2
Katie      1
Name: Number of countries visited by Data 14, dtype: int64

Dataframes are two dimensional, size mutable and possibly heterogenous

In [38]:
data = [['John', 5], ['Anna', 7], ['Tim', 10], ['Max', 12]]
data

[['John', 5], ['Anna', 7], ['Tim', 10], ['Max', 12]]

In [41]:
df = pd.DataFrame(data)
df

      0   1
0  John   5
1  Anna   7
2   Tim  10
3   Max  12

In [42]:
df = pd.DataFrame(data, columns=['Name', 'Number'], dtype=int, index=['ID34', 'ID45', 'ID12', 'ID98'])
df

      Name  Number
ID34  John       5
ID45  Anna       7
ID12   Tim      10
ID98   Max      12

In [43]:
type(df['Name'])

pandas.core.series.Series

In [44]:
d1 = {'Name': ['A', 'B', 'C'], 'Numbers': [1,2,3]}
d1

{'Name': ['A', 'B', 'C'], 'Numbers': [1, 2, 3]}

In [46]:
df2 = pd.DataFrame(d1)
df2
# We note that the keys in the original dictionary have become the column names

  Name  Numbers
0    A        1
1    B        2
2    C        3

In [50]:
l1 = [{'Name':'A', 'Number':'1'}, {'Name':'B', 'Number': 2, 'Animal':'cat'}]
df3 = pd.DataFrame(l1)
df3
# NaN value for index 0 because there is no entry for it in the animal column

  Name Number Animal
0    A      1    NaN
1    B      2    cat

In [52]:
east = pd.Series([1000, 2000, 3000], index=['Q1', 'Q2', 'Q3'])
west = pd.Series([1000, 2000, 3000, 65490], index=['Q1', 'Q2', 'Q3', 'Q4'])
east
west

Q1     1000
Q2     2000
Q3     3000
Q4    65490
dtype: int64

In [53]:
sales_df = pd.DataFrame({'East':east, 'West':west})
sales_df

      East   West
Q1  1000.0   1000
Q2  2000.0   2000
Q3  3000.0   3000
Q4     NaN  65490

In [54]:
south = pd.Series([200, 400], index=['Q1', 'Q2'])
north = pd.Series([500, 600, 4688, 244, 900], index = ['Q1', 'Q2', 'Q3', 'Q4', 'Q5'])
new_df = pd.DataFrame({'East':east, 'West':west, 'South':south, 'North':north})
new_df.index.name = 'Q'
new_df

      East     West  South  North
Q
Q1  1000.0   1000.0  200.0    500
Q2  2000.0   2000.0  400.0    600
Q3  3000.0   3000.0    NaN   4688
Q4     NaN  65490.0    NaN    244
Q5     NaN      NaN    NaN    900

In [59]:
new_df = new_df.reindex(['Q0','Q1', 'Q2', 'Q3', 'Q4'])
new_df

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [60]:
new_df.reindex(columns = ['North', 'East', 'South', 'West'])

     North    East  South     West
Q
Q0     NaN     NaN    NaN      NaN
Q1   500.0  1000.0  200.0   1000.0
Q2   600.0  2000.0  400.0   2000.0
Q3  4688.0  3000.0    NaN   3000.0
Q4   244.0     NaN    NaN  65490.0

In [61]:
new_df.drop('Q1')

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [62]:
new_df.drop('East', axis=1)
# Axis 0 is row
# Axis 1 is column
# Can also specify the columns: new_df.drop(columns='East')

       West  South   North
Q
Q0      NaN    NaN     NaN
Q1   1000.0  200.0   500.0
Q2   2000.0  400.0   600.0
Q3   3000.0    NaN  4688.0
Q4  65490.0    NaN   244.0

In [63]:
new_df['West']

Q
Q0        NaN
Q1     1000.0
Q2     2000.0
Q3     3000.0
Q4    65490.0
Name: West, dtype: float64

In [66]:
new_df[new_df['West']>1100] # Filtered out the west column based on the condition

      East     West  South   North
Q
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [67]:
new_df

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [68]:
new_df.loc['Q2'] # This will return the row of the index specified

East     2000.0
West     2000.0
South     400.0
North     600.0
Name: Q2, dtype: float64

In [69]:
new_df.iloc[2] # this will return the same results but different method

East     2000.0
West     2000.0
South     400.0
North     600.0
Name: Q2, dtype: float64

In [70]:
new_df.sort_index(ascending=0) # By default it will sort by ascending

      East     West  South   North
Q
Q4     NaN  65490.0    NaN   244.0
Q3  3000.0   3000.0    NaN  4688.0
Q2  2000.0   2000.0  400.0   600.0
Q1  1000.0   1000.0  200.0   500.0
Q0     NaN      NaN    NaN     NaN

In [71]:
new_df.min() # Minimum Values

East     1000.0
West     1000.0
South     200.0
North     244.0
dtype: float64

In [72]:
new_df.max() # Maximum values

East      3000.0
West     65490.0
South      400.0
North     4688.0
dtype: float64

In [74]:
new_df.describe() # Descriptive Statistics

         East          West       South        North
count     3.0      4.000000    2.000000     4.000000
mean   2000.0  17872.500000  300.000000  1508.000000
std    1000.0  31755.498605  141.421356  2125.294019
min    1000.0   1000.000000  200.000000   244.000000
25%    1500.0   1750.000000  250.000000   436.000000
50%    2000.0   2500.000000  300.000000   550.000000
75%    2500.0  18622.500000  350.000000  1622.000000
max    3000.0  65490.000000  400.000000  4688.000000

In [75]:
new_df.dropna()

      East    West  South  North
Q
Q1  1000.0  1000.0  200.0  500.0
Q2  2000.0  2000.0  400.0  600.0

In [76]:
new_df

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [77]:
new_df.dropna(thresh=1)
# The threshold is the number of non NaNs we require to be in our df

      East     West  South   North
Q
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [79]:
new_df.dropna(thresh=3)

      East    West  South   North
Q
Q1  1000.0  1000.0  200.0   500.0
Q2  2000.0  2000.0  400.0   600.0
Q3  3000.0  3000.0    NaN  4688.0

In [80]:
new_df2 = new_df.reindex(columns=['East', 'West', 'North', 'South', 'Extra'])
new_df2

      East     West   North  South  Extra
Q
Q0     NaN      NaN     NaN    NaN    NaN
Q1  1000.0   1000.0   500.0  200.0    NaN
Q2  2000.0   2000.0   600.0  400.0    NaN
Q3  3000.0   3000.0  4688.0    NaN    NaN
Q4     NaN  65490.0   244.0    NaN    NaN

In [81]:
new_df2.dropna(axis=1, how='all')
# Drop all the columns that only have NaN values

      East     West   North  South
Q
Q0     NaN      NaN     NaN    NaN
Q1  1000.0   1000.0   500.0  200.0
Q2  2000.0   2000.0   600.0  400.0
Q3  3000.0   3000.0  4688.0    NaN
Q4     NaN  65490.0   244.0    NaN

In [82]:
new_df

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [83]:
new_df.fillna(0)

      East     West  South   North
Q
Q0     0.0      0.0    0.0     0.0
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    0.0  4688.0
Q4     0.0  65490.0    0.0   244.0

In [84]:
new_df.fillna(method='ffill') # ffill front fill, bfill backfill

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0  400.0  4688.0
Q4  3000.0  65490.0  400.0   244.0

In [85]:
new_df

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0    NaN  4688.0
Q4     NaN  65490.0    NaN   244.0

In [86]:
new_df.interpolate()

      East     West  South   North
Q
Q0     NaN      NaN    NaN     NaN
Q1  1000.0   1000.0  200.0   500.0
Q2  2000.0   2000.0  400.0   600.0
Q3  3000.0   3000.0  400.0  4688.0
Q4  3000.0  65490.0  400.0   244.0

In [87]:
from numpy.random import random

In [90]:
s1 = pd.Series(random(6), index=[[1,1,1,2,2,2], ['a', 'b', 'c', 'a', 'b', 'c']])
s1

1  a    0.804490
   b    0.755139
   c    0.037660
2  a    0.910206
   b    0.769962
   c    0.723448
dtype: float64

In [91]:
s1[1]

a    0.804490
b    0.755139
c    0.037660
dtype: float64

In [92]:
s1[:, 'a'] # This will look for everything we have for a in both index 1 and 2

1    0.804490
2    0.910206
dtype: float64

In [93]:
s1.unstack()

          a         b         c
1  0.804490  0.755139  0.037660
2  0.910206  0.769962  0.723448

In [95]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4), index=[['J', 'J', 'F', 'F'], [2011, 2012, 2011, 2012]],
                  columns=[['NY', 'NY', 'LA', 'SPO'], ['Cold', 'Hot', 'Hot', 'Cold']])
df2
# A Dataframe with multi-index and multi-column
# We can rename our columns to make things a little bit easier to see

         NY      LA  SPO
       Cold Hot Hot Cold
J 2011    0   1   2    3
  2012    4   5   6    7
F 2011    8   9  10   11
  2012   12  13  14   15

In [96]:
df2.index.names=['Month', 'Year']
df2.columns.names=['City', 'Temperature']
df2

City          NY      LA  SPO
Temperature Cold Hot Hot Cold
Month Year
J     2011     0   1   2    3
      2012     4   5   6    7
F     2011     8   9  10   11
      2012    12  13  14   15

In [97]:
df2.swaplevel('City', 'Temperature', axis=1)

Temperature Cold Hot     Cold
City          NY  NY  LA  SPO
Month Year
J     2011     0   1   2    3
      2012     4   5   6    7
F     2011     8   9  10   11
      2012    12  13  14   15

In [98]:
df2.sort_index(level=1)

City          NY      LA  SPO
Temperature Cold Hot Hot Cold
Month Year
F     2011     8   9  10   11
J     2011     0   1   2    3
F     2012    12  13  14   15
J     2012     4   5   6    7

In [101]:
df2.sum(level='Year').sum(level='Temperature', axis=1)

Temperature  Cold  Hot
Year
2011           22   22
2012           38   38